{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<|padding|>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<|padding|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 69,
      "content": "<|startoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|padding|>": 0,
      "<|endoftext|>": 1,
      ",": 2,
      "#": 3,
      "0": 4,
      "1": 5,
      "2": 6,
      "3": 7,
      "4": 8,
      "5": 9,
      "6": 10,
      "7": 11,
      "8": 12,
      "9": 13,
      ":": 14,
      "=": 15,
      "A": 16,
      "B": 17,
      "C": 18,
      "D": 19,
      "E": 20,
      "F": 21,
      "G": 22,
      "H": 23,
      "I": 24,
      "J": 25,
      "K": 26,
      "L": 27,
      "M": 28,
      "N": 29,
      "O": 30,
      "P": 31,
      "Q": 32,
      "R": 33,
      "S": 34,
      "T": 35,
      "U": 36,
      "V": 37,
      "W": 38,
      "X": 39,
      "Y": 40,
      "Z": 41,
      "a": 42,
      "b": 43,
      "c": 44,
      "d": 45,
      "e": 46,
      "f": 47,
      "g": 48,
      "h": 49,
      "i": 50,
      "j": 51,
      "k": 52,
      "l": 53,
      "m": 54,
      "n": 55,
      "o": 56,
      "p": 57,
      "q": 58,
      "r": 59,
      "s": 60,
      "t": 61,
      "u": 62,
      "v": 63,
      "w": 64,
      "x": 65,
      "y": 66,
      "z": 67,
      "\n": 68,
      "<|startoftext|>": 69
    },
    "merges": []
  }
}